; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 179)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 129)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet4)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 163)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared0)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 195)
	(= (data Star3 thermograph1) 71)
	(= (data Planet4 thermograph1) 11)
	(= (data Star5 thermograph1) 201)
	(= (data Planet6 thermograph1) 182)
	(= (data Planet7 thermograph1) 37)
	(= (data Phenomenon8 thermograph1) 213)
	(= (data Planet9 thermograph1) 275)
	(= (data Star3 image2) 129)
	(= (data Planet4 image2) 176)
	(= (data Star5 image2) 253)
	(= (data Planet6 image2) 132)
	(= (data Planet7 image2) 269)
	(= (data Phenomenon8 image2) 257)
	(= (data Planet9 image2) 285)
	(= (data Star3 infrared0) 179)
	(= (data Planet4 infrared0) 110)
	(= (data Star5 infrared0) 96)
	(= (data Planet6 infrared0) 224)
	(= (data Planet7 infrared0) 294)
	(= (data Phenomenon8 infrared0) 157)
	(= (data Planet9 infrared0) 215)
	(= (slew_time Star2 GroundStation0) 41)
	(= (slew_time GroundStation0 Star2) 41)
	(= (slew_time Star2 Star1) 54.42)
	(= (slew_time Star1 Star2) 54.42)
	(= (slew_time Star1 GroundStation0) 4.97)
	(= (slew_time GroundStation0 Star1) 4.97)
	(= (slew_time Star3 GroundStation0) 8.866)
	(= (slew_time GroundStation0 Star3) 8.866)
	(= (slew_time Star3 Star1) 28.43)
	(= (slew_time Star1 Star3) 28.43)
	(= (slew_time Star3 Star2) 30.97)
	(= (slew_time Star2 Star3) 30.97)
	(= (slew_time Planet4 GroundStation0) 4.32)
	(= (slew_time GroundStation0 Planet4) 4.32)
	(= (slew_time Planet4 Star1) 53)
	(= (slew_time Star1 Planet4) 53)
	(= (slew_time Planet4 Star2) 20.09)
	(= (slew_time Star2 Planet4) 20.09)
	(= (slew_time Planet4 Star3) 50.28)
	(= (slew_time Star3 Planet4) 50.28)
	(= (slew_time Star5 GroundStation0) 12.6)
	(= (slew_time GroundStation0 Star5) 12.6)
	(= (slew_time Star5 Star1) 55.43)
	(= (slew_time Star1 Star5) 55.43)
	(= (slew_time Star5 Star2) 7.706)
	(= (slew_time Star2 Star5) 7.706)
	(= (slew_time Star5 Star3) 47.55)
	(= (slew_time Star3 Star5) 47.55)
	(= (slew_time Star5 Planet4) 1.951)
	(= (slew_time Planet4 Star5) 1.951)
	(= (slew_time Planet6 GroundStation0) 38.43)
	(= (slew_time GroundStation0 Planet6) 38.43)
	(= (slew_time Planet6 Star1) 59.38)
	(= (slew_time Star1 Planet6) 59.38)
	(= (slew_time Planet6 Star2) 32.47)
	(= (slew_time Star2 Planet6) 32.47)
	(= (slew_time Planet6 Star3) 39.42)
	(= (slew_time Star3 Planet6) 39.42)
	(= (slew_time Planet6 Planet4) 17.8)
	(= (slew_time Planet4 Planet6) 17.8)
	(= (slew_time Planet6 Star5) 20.48)
	(= (slew_time Star5 Planet6) 20.48)
	(= (slew_time Planet7 GroundStation0) 2.193)
	(= (slew_time GroundStation0 Planet7) 2.193)
	(= (slew_time Planet7 Star1) 45.51)
	(= (slew_time Star1 Planet7) 45.51)
	(= (slew_time Planet7 Star2) 35.28)
	(= (slew_time Star2 Planet7) 35.28)
	(= (slew_time Planet7 Star3) 15.86)
	(= (slew_time Star3 Planet7) 15.86)
	(= (slew_time Planet7 Planet4) 5.317)
	(= (slew_time Planet4 Planet7) 5.317)
	(= (slew_time Planet7 Star5) 71.85)
	(= (slew_time Star5 Planet7) 71.85)
	(= (slew_time Planet7 Planet6) 12.35)
	(= (slew_time Planet6 Planet7) 12.35)
	(= (slew_time Phenomenon8 GroundStation0) 10.87)
	(= (slew_time GroundStation0 Phenomenon8) 10.87)
	(= (slew_time Phenomenon8 Star1) 34.39)
	(= (slew_time Star1 Phenomenon8) 34.39)
	(= (slew_time Phenomenon8 Star2) 1.673)
	(= (slew_time Star2 Phenomenon8) 1.673)
	(= (slew_time Phenomenon8 Star3) 19.96)
	(= (slew_time Star3 Phenomenon8) 19.96)
	(= (slew_time Phenomenon8 Planet4) 20.49)
	(= (slew_time Planet4 Phenomenon8) 20.49)
	(= (slew_time Phenomenon8 Star5) 13.43)
	(= (slew_time Star5 Phenomenon8) 13.43)
	(= (slew_time Phenomenon8 Planet6) 5.677)
	(= (slew_time Planet6 Phenomenon8) 5.677)
	(= (slew_time Phenomenon8 Planet7) 20.03)
	(= (slew_time Planet7 Phenomenon8) 20.03)
	(= (slew_time Planet9 GroundStation0) 17.42)
	(= (slew_time GroundStation0 Planet9) 17.42)
	(= (slew_time Planet9 Star1) 80.37)
	(= (slew_time Star1 Planet9) 80.37)
	(= (slew_time Planet9 Star2) 29.63)
	(= (slew_time Star2 Planet9) 29.63)
	(= (slew_time Planet9 Star3) 25.87)
	(= (slew_time Star3 Planet9) 25.87)
	(= (slew_time Planet9 Planet4) 23.18)
	(= (slew_time Planet4 Planet9) 23.18)
	(= (slew_time Planet9 Star5) 50.8)
	(= (slew_time Star5 Planet9) 50.8)
	(= (slew_time Planet9 Planet6) 18.95)
	(= (slew_time Planet6 Planet9) 18.95)
	(= (slew_time Planet9 Planet7) 77.8)
	(= (slew_time Planet7 Planet9) 77.8)
	(= (slew_time Planet9 Phenomenon8) 75.08)
	(= (slew_time Phenomenon8 Planet9) 75.08)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite1 Star2)
	(have_image Star3 thermograph1)
	(have_image Star5 infrared0)
	(have_image Planet6 image2)
	(have_image Planet7 image2)
	(have_image Phenomenon8 image2)
	(have_image Planet9 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 planet7 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet7)
   changed: (fuel satellite3) from 195 to 182.65, (fuel-used) from 0 to 12.35
   goals met: 0 of 8
2. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 179 to 160.05, (fuel-used) from 12.35 to 31.3
   goals met: 1 of 8
3. (turn_to satellite3 groundstation0 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation0)
   changed: (fuel satellite3) from 182.65 to 180.457, (fuel-used) from 31.3 to 33.493
   goals met: 1 of 8
4. (turn_to satellite1 phenomenon8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 129 to 123.323, (fuel-used) from 33.493 to 39.17
   goals met: 1 of 8
5. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 8
6. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 1 of 8
7. (turn_to satellite3 planet9 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet9)
   changed: (fuel satellite3) from 180.457 to 163.037, (fuel-used) from 39.17 to 56.59
   goals met: 1 of 8
8. (turn_to satellite2 star3 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 163 to 112.72, (fuel-used) from 56.59 to 106.87
   goals met: 1 of 8
9. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 123.323 to 121.65, (fuel-used) from 106.87 to 108.543
   goals met: 2 of 8
10. (turn_to satellite1 planet6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 121.65 to 89.18, (fuel-used) from 108.543 to 141.013
   goals met: 1 of 8
11. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 112.72 to 103.854, (fuel-used) from 141.013 to 149.879
   goals met: 1 of 8
12. (turn_to satellite2 star3 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 103.854 to 94.988, (fuel-used) from 149.879 to 158.745
   goals met: 1 of 8
13. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 94.988 to 86.122, (fuel-used) from 158.745 to 167.611
   goals met: 1 of 8
14. (turn_to satellite2 star1 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 86.122 to 81.152, (fuel-used) from 167.611 to 172.581
   goals met: 1 of 8
15. (turn_to satellite1 star5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 89.18 to 68.7, (fuel-used) from 172.581 to 193.061
   goals met: 1 of 8
16. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
17. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 1 of 8
18. (turn_to satellite2 star3 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 81.152 to 52.722, (fuel-used) from 193.061 to 221.491
   goals met: 1 of 8
19. (turn_to satellite1 planet6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 68.7 to 48.22, (fuel-used) from 221.491 to 241.971
   goals met: 1 of 8
20. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 52.722 to 43.856, (fuel-used) from 241.971 to 250.837
   goals met: 1 of 8
21. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 1 of 8
22. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 8
23. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 1 of 8
24. (turn_to satellite2 planet7 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 43.856 to 41.663, (fuel-used) from 250.837 to 253.03
   goals met: 1 of 8
25. (take_image satellite2 planet7 instrument5 image2)
   added: (have_image planet7 image2)
   changed: (data_capacity satellite2) from 1000 to 731, (data-stored) from 0 to 269
   goals met: 2 of 8
26. (turn_to satellite2 star3 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 41.663 to 25.803, (fuel-used) from 253.03 to 268.89
   goals met: 2 of 8
27. (turn_to satellite1 phenomenon8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 48.22 to 42.543, (fuel-used) from 268.89 to 274.567
   goals met: 2 of 8
28. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 42.543 to 40.87, (fuel-used) from 274.567 to 276.24
   goals met: 3 of 8
29. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 40.87 to 39.197, (fuel-used) from 276.24 to 277.913
   goals met: 2 of 8
30. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 39.197 to 37.524, (fuel-used) from 277.913 to 279.586
   goals met: 3 of 8
31. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 37.524 to 35.851, (fuel-used) from 279.586 to 281.259
   goals met: 2 of 8
32. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 35.851 to 34.178, (fuel-used) from 281.259 to 282.932
   goals met: 3 of 8
33. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 34.178 to 32.505, (fuel-used) from 282.932 to 284.605
   goals met: 2 of 8
34. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 32.505 to 30.832, (fuel-used) from 284.605 to 286.278
   goals met: 3 of 8
35. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 8
36. (take_image satellite3 planet9 instrument7 thermograph1)
   added: (have_image planet9 thermograph1)
   changed: (data_capacity satellite3) from 1000 to 725, (data-stored) from 269 to 544
   goals met: 4 of 8
37. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 4 of 8
38. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 30.832 to 29.159, (fuel-used) from 286.278 to 287.951
   goals met: 3 of 8
39. (turn_to satellite1 star5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 29.159 to 15.729, (fuel-used) from 287.951 to 301.381
   goals met: 3 of 8
40. (take_image satellite1 star5 instrument2 infrared0)
   added: (have_image star5 infrared0)
   changed: (data_capacity satellite1) from 1000 to 904, (data-stored) from 544 to 640
   goals met: 4 of 8
41. (turn_to satellite1 phenomenon8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 15.729 to 2.299, (fuel-used) from 301.381 to 314.811
   goals met: 4 of 8
42. (turn_to satellite3 planet6 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 163.037 to 144.087, (fuel-used) from 314.811 to 333.761
   goals met: 4 of 8
43. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 2.299 to 0.626, (fuel-used) from 333.761 to 335.434
   goals met: 5 of 8
44. (turn_to satellite3 phenomenon8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon8)
   changed: (fuel satellite3) from 144.087 to 138.41, (fuel-used) from 335.434 to 341.111
   goals met: 5 of 8
45. (turn_to satellite3 planet6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 138.41 to 132.733, (fuel-used) from 341.111 to 346.788
   goals met: 5 of 8
46. (turn_to satellite3 phenomenon8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon8)
   changed: (fuel satellite3) from 132.733 to 127.056, (fuel-used) from 346.788 to 352.465
   goals met: 5 of 8
47. (turn_to satellite3 planet6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 127.056 to 121.379, (fuel-used) from 352.465 to 358.142
   goals met: 5 of 8
48. (turn_to satellite3 phenomenon8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon8)
   changed: (fuel satellite3) from 121.379 to 115.702, (fuel-used) from 358.142 to 363.819
   goals met: 5 of 8
49. (turn_to satellite3 planet6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 115.702 to 110.025, (fuel-used) from 363.819 to 369.496
   goals met: 5 of 8
50. (take_image satellite3 planet6 instrument7 image2)
   added: (have_image planet6 image2)
   changed: (data_capacity satellite3) from 725 to 593, (data-stored) from 640 to 772
   goals met: 6 of 8
51. (turn_to satellite3 phenomenon8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon8)
   changed: (fuel satellite3) from 110.025 to 104.348, (fuel-used) from 369.496 to 375.173
   goals met: 6 of 8
52. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 6 of 8
53. (switch_on instrument4 satellite2)
   deleted: (calibrated instrument4) (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 6 of 8
54. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 25.803 to 16.937, (fuel-used) from 375.173 to 384.039
   goals met: 6 of 8
55. (take_image satellite3 phenomenon8 instrument7 image2)
   added: (have_image phenomenon8 image2)
   changed: (data_capacity satellite3) from 593 to 336, (data-stored) from 772 to 1029
   goals met: 7 of 8
56. (turn_to satellite2 star1 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 16.937 to 11.967, (fuel-used) from 384.039 to 389.009
   goals met: 7 of 8
57. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 7 of 8
58. (turn_to satellite2 groundstation0 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 11.967 to 6.997, (fuel-used) from 389.009 to 393.979
   goals met: 7 of 8
59. (turn_to satellite3 star3 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star3)
   changed: (fuel satellite3) from 104.348 to 84.388, (fuel-used) from 393.979 to 413.939
   goals met: 7 of 8
60. (take_image satellite3 star3 instrument7 thermograph1)
   added: (have_image star3 thermograph1)
   changed: (data_capacity satellite3) from 336 to 265, (data-stored) from 1029 to 1100
   goals met: 8 of 8
